Revit 2027 API
Document.NewAreas Method
Creates new areas
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementSet NewAreas(
	List<AreaCreationData> dataList
)
Public Function NewAreas (
	dataList As List(Of AreaCreationData)
) As ElementSet
public:
ElementSet^ NewAreas(
	List<AreaCreationData^>^ dataList
)
member NewAreas :
        dataList : List<AreaCreationData> -> ElementSet
Parameters
dataList List<AreaCreationData>
A list of AreaCreationData which wraps the creation arguments of the areas to be created.
Return Value
ElementSet
 If successful an Element Set which contains the areas should be returned, otherwise the exception will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  If AreaCreationData's areaPoint is null.
InvalidOperationException | If the area cannot be created successfully or the phase is invalid or regeneration fails at the end of the batch creation.
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace